In [2]:
import pandas as pd

In [13]:
df = pd.read_csv('c:/data/examples/ex1.csv')

In [14]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
pd.read_table('c:/data/examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

pandas가 자동으로 컬럼 이름을 생성하도록 하거나 우리가 직접 컬럼이름을 지정한다.

In [20]:
pd.read_csv('c:\data\examples\ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [21]:
pd.read_csv("c:\data\examples\ex2.csv", names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

- message 컬럼을 색인으로 하는 DataFrame을 반환하려면 index_col 인자에 4번째 컬럼 또는 'message' 이름을 가진 컬럼을 지정해서 색인으로 만들 수 있다.

In [23]:
names = ['a','b','c','d','message']

pd.read_csv('c:/data/examples/ex2.csv', names = names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

- 계층적 색인을 지정하고 싶다면 컬럼 번호나 이름의 리스트를 넘기면 된다.

In [25]:
parsed = pd.read_csv('c:/data/examples/csv_mindex.csv', index_col = ['key1','key2'])

In [26]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [27]:
list(open('c:/data/examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [28]:
#정규 표현식을 사용해 정제해주자
result = pd.read_table('c:/data/examples/ex3.txt', sep = '\s+')

In [29]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [33]:
pd.read_csv('c:/data/examples/ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [30]:
pd.read_csv('c:/data/examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

- NaN 값 채우기

In [36]:
result = pd.read_csv('c:/data/examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [37]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [39]:
result = pd.read_csv('c:/data/examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [41]:
sentinels = {'message':['foo', 'NA'], 'something': ['two']}

pd.read_csv('c:/data/examples/ex5.csv', na_values= sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

- pandas의 출력 설정하는 방법

In [5]:
pd.options.display.max_rows = 10

In [6]:
result = pd.read_csv('c:/data/examples/ex6.csv')

result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [9]:
# 처음 몇 줄만 보는 방법 nrows 옵션 사용

pd.read_csv('c:/data/examples/ex6.csv',nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [10]:
# 파일을 조각으로 나누는 방법 chunksize 옵션으로 로우의 개수를 조절

chunker = pd.read_csv('c:/data/examples/ex6.csv', chunksize = 1000)

In [11]:
chunker

- read_csv에서 반환된 TextParser 객체를 이용해서 chunksize에 따라 분리된 파일들을 순회 할 수 있다.
- 예를 들어 위에 파일을 순회하면서 'key' 로우에 있는 값을 세어보려면 다음처럼 하면 된다.

In [15]:
chunker = pd.read_csv('c:/data/examples/ex6.csv', chunksize= 1000)

tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value = 0)
    
tot = tot.sort_values(ascending=False)

<ipython-input-15-8c0857df8d13>:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

- Textparser는 임의 크기의 조각을 읽을 수 있는 get_chunk 메서드도 포함하고 있다.

In [17]:
tot

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

### 데이터를 텍스트 형식으로 기록하는 방법
- 읽어오기와 마찬가지로 데이터를 구분자로 구분한 형식으로 내보내는 것도 가능하다
- 위에서 읽었던 csv로 예시를 들어보자

In [18]:
data = pd.read_csv('c:/data/examples/ex5.csv')

In [19]:
# DataFrame의 to_csv method를 이용하면 데이터를 쉼표로 구분된 형식으로 파일에 쓸 수 있다.

data.to_csv('c:/data/examples/out.csv')

- 콘솔에서 확인할 수 있도록 실제 파일로 기록하지 않고 sys.stdout에 결과를 기록하도록 할 수도 있다.

In [20]:
import sys

data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

- 결과에서 누락된 값은 비어 있는 문자열로 나타나는데, 이것 역시도 원하는 값으로 지정이 가능하다.

In [21]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

- 다른 옵션을 명시하지 않으면 로우와 컬럼 이름이 기록된다.
- 로우와 컬럼 이름을 포함하지 않는 방법은 다음과 같다

In [23]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

- 컬럼의 일부붐만 기록하는 방법과, 순서 지정 방법

In [24]:
data.to_csv(sys.stdout, index=False, columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

- series에도 to_csv method가 존재한다.

In [26]:
import numpy as np

In [27]:
dates = pd.date_range('1/1/2000', periods=7)

ts = pd.Series(np.arange(7), index = dates)

ts.to_csv('c:/data/examples/tseries.csv')

### 구분자 형식 다루기
- pandas_resd_table 함수를 이용해서 디스크에 표 형태로 저장된 대부분의 파일 형식을 불러올 수 있다.
- 하지만 수동으로 처리해야 하는 경우도 있다.
- read_table 함수가 데이터를 불러오는데 실패하게끔 만든 잘못된 라인이 포함되어 있는 데이터를 전달받는 경우도 종종 있다.

- 구분자가 한 글자인 파일은 파이썬 내장 csv 모듈을 이용해서 처리할 수 있다.
- 열려진 파일 객체를 csv.reader 함수에 넘기기만 하면 된다.

In [30]:
import csv

f = open('c:/data/examples/ex7.csv')

reader = csv.reader(f)

- reader를 순회하면서 둘러싸고 있던 큰따옴표가 제거된 튜플을 얻을 수 있다.

In [31]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [32]:
with open('c:/data/examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [34]:
header, values = lines[0], lines[1:]

- 사전 표기법과 로우를 컬럼으로 전치해주는 zip(*values)를 이용해서 데이터 컬럼 사전을 만들어보자

In [35]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

- csv 파일은 다양한 형태로 존재할 수 있다. 다양한 구분자, 문자열을 둘러싼느 방법, 개행 문자 같은 것들은  csv.Dialect를 상속받아 새로운 클래스를 정의해서 해결할 수 있다.

In [39]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [40]:
reader = csv.reader(f, dialect=my_dialect)

TypeError: argument 1 must be an iterator